**Consider the following Python dictionary data and Python list labels:**

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

**1. Create a DataFrame birds from this dictionary data which has the index labels.**

In [1]:
import pandas as pd
import numpy as np

Birds = {
    'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'], 
    'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4], 
    'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2], 
    'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}
Birds_DataFrame = pd.DataFrame(Birds,index=['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])
Birds_DataFrame.head()

## Indexing can be done using the below as well.

## labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

## Birds_DataFrame = pd.DataFrame(Birds , index=labels)

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
c     plovers  1.5       3       no
d  spoonbills  NaN       4      yes
e  spoonbills  6.0       3       no

**2. Display a summary of the basic information about birds DataFrame and its data.**

In [2]:
Birds = {
    'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'], 
    'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4], 
    'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2], 
    'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}
Birds_DataFrame = pd.DataFrame(Birds)
Birds_DataFrame.head()
print("Summary of the basic information about birds DataFrame and its data:")
print(Birds_DataFrame.info())

Summary of the basic information about birds DataFrame and its data:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
birds       10 non-null object
age         8 non-null float64
visits      10 non-null int64
priority    10 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 448.0+ bytes
None

**3. Print the first 2 rows of the birds dataframe **

In [3]:
print("First two rows of the birds data frame:")
print(Birds_DataFrame.iloc[:2])

First two rows of the birds data frame:
    birds  age  visits priority
0  Cranes  3.5       2      yes
1  Cranes  4.0       4      yes

**4. Print all the rows with only 'birds' and 'age' columns from the dataframe**

In [5]:
print("All the rows with only 'birds' and 'age' columns from the dataframe:")
print(Birds_DataFrame[['birds', 'age']])

All the rows with only 'birds' and 'age' columns from the dataframe:
        birds  age
0      Cranes  3.5
1      Cranes  4.0
2     plovers  1.5
3  spoonbills  NaN
4  spoonbills  6.0
5      Cranes  3.0
6     plovers  5.5
7      Cranes  NaN
8  spoonbills  8.0
9  spoonbills  4.0

**5. select [2, 3, 7] rows and in columns ['birds', 'age', 'visits']**

In [6]:
print("2nd,3rd and 7th rows from the columns birds,age and Visits")

Birds_DataFrame.loc[[2,3,7],['birds', 'age', 'visits']]

2nd,3rd and 7th rows from the columns birds,age and Visits

        birds  age  visits
2     plovers  1.5       3
3  spoonbills  NaN       4
7      Cranes  NaN       2

**6. select the rows where the number of visits is less than 4**

In [7]:
Groupby_Visits = Birds_DataFrame.groupby('visits')
for visit,visit_df in Groupby_Visits:
    if visit < 4:
        print(visit_df)

        birds  age  visits priority
0      Cranes  3.5       2      yes
6     plovers  5.5       2       no
7      Cranes  NaN       2      yes
9  spoonbills  4.0       2       no
        birds  age  visits priority
2     plovers  1.5       3       no
4  spoonbills  6.0       3       no
8  spoonbills  8.0       3       no

In [8]:
Birds_DataFrame[Birds_DataFrame['visits']<4]

        birds  age  visits priority
0      Cranes  3.5       2      yes
2     plovers  1.5       3       no
4  spoonbills  6.0       3       no
6     plovers  5.5       2       no
7      Cranes  NaN       2      yes
8  spoonbills  8.0       3       no
9  spoonbills  4.0       2       no

**7. select the rows with columns ['birds', 'visits'] where the age is missing i.e NaN**

In [11]:
print(Birds_DataFrame[Birds_DataFrame['age'].isnull()])

        birds  age  visits priority
3  spoonbills  NaN       4      yes
7      Cranes  NaN       2      yes

In [12]:
print(Birds_DataFrame[Birds_DataFrame.isnull().any(axis=1)])
# This gives the matching answer as above because there are no null values in other cells.

        birds  age  visits priority
3  spoonbills  NaN       4      yes
7      Cranes  NaN       2      yes

In [ ]:
## But I am unable fullfil the request , to genearte the output with Birds and Visit columns.

**8. Select the rows where the birds is a Cranes and the age is less than 4**

In [9]:
Birds_Age  = (Birds_DataFrame['birds'] == 'Cranes') & (Birds_DataFrame['age']<4)
Birds_Age_review = Birds_DataFrame[Birds_Age]
print(Birds_Age_review)

    birds  age  visits priority
0  Cranes  3.5       2      yes
5  Cranes  3.0       4       no

**9. Select the rows the age is between 2 and 4(inclusive)**

In [13]:
## Replaceing the null values with mean of age column
## Birds_DataFrame['age'] = round(Birds_DataFrame['age'].replace(np.nan, Birds_DataFrame['age'].mean()),1)
## Converting the float values in age column to int
## Birds_DataFrame['age'] = Birds_DataFrame.age.astype(int)
print("Rows from the age column in between 2 and 4(inclusive):")
print(Birds_DataFrame[Birds_DataFrame['age'].between(2.0,4.0)])

Rows from the age column in between 2 and 4(inclusive):
        birds  age  visits priority
0      Cranes  3.5       2      yes
1      Cranes  4.0       4      yes
5      Cranes  3.0       4       no
9  spoonbills  4.0       2       no

**10. Find the total number of visits of the bird Cranes**

In [14]:
Cranes=Birds_DataFrame.groupby(['birds']).sum() 
Cranes['visits']['Cranes']

12

**11. Calculate the mean age for each different birds in dataframe.**

In [15]:
Birds_DataFrame.groupby('birds')['age'].mean()

birds
Cranes        3.5
plovers       3.5
spoonbills    6.0
Name: age, dtype: float64

**12. Append a new row 'k' to dataframe with your choice of values for each column. Then delete that row to return the original DataFrame.**

In [16]:
# Appending a new row to Data Frame
Birds_DataFrame.loc['k'] = ['plovers',5.3,3,'yes']
# Print all records with new row 'K'
print(Birds_DataFrame)
# Delete the new row and display the original  rows
Birds_DataFrame = Birds_DataFrame.drop('k')
# Print the data frame after deleting the added row.
print(Birds_DataFrame)

        birds  age  visits priority
0      Cranes  3.5       2      yes
1      Cranes  4.0       4      yes
2     plovers  1.5       3       no
3  spoonbills  NaN       4      yes
4  spoonbills  6.0       3       no
5      Cranes  3.0       4       no
6     plovers  5.5       2       no
7      Cranes  NaN       2      yes
8  spoonbills  8.0       3       no
9  spoonbills  4.0       2       no
k     plovers  5.3       3      yes
        birds  age  visits priority
0      Cranes  3.5       2      yes
1      Cranes  4.0       4      yes
2     plovers  1.5       3       no
3  spoonbills  NaN       4      yes
4  spoonbills  6.0       3       no
5      Cranes  3.0       4       no
6     plovers  5.5       2       no
7      Cranes  NaN       2      yes
8  spoonbills  8.0       3       no
9  spoonbills  4.0       2       no

**13. Find the number of each type of birds in dataframe (Counts)**

In [17]:
Birds_DataFrame.groupby('birds').size()

birds
Cranes        4
plovers       2
spoonbills    4
dtype: int64

**14. Sort dataframe (birds) first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order.**

In [18]:
Age_Decending =Birds_DataFrame.sort_values(by='age', ascending=False)
print(Age_Decending)
print('='*50)
Visits_Ascending =Birds_DataFrame.sort_values(by='visits', ascending=True)
print(Visits_Ascending)

        birds  age  visits priority
8  spoonbills  8.0       3       no
4  spoonbills  6.0       3       no
6     plovers  5.5       2       no
1      Cranes  4.0       4      yes
9  spoonbills  4.0       2       no
0      Cranes  3.5       2      yes
5      Cranes  3.0       4       no
2     plovers  1.5       3       no
3  spoonbills  NaN       4      yes
7      Cranes  NaN       2      yes
==================================================
        birds  age  visits priority
0      Cranes  3.5       2      yes
6     plovers  5.5       2       no
7      Cranes  NaN       2      yes
9  spoonbills  4.0       2       no
2     plovers  1.5       3       no
4  spoonbills  6.0       3       no
8  spoonbills  8.0       3       no
1      Cranes  4.0       4      yes
3  spoonbills  NaN       4      yes
5      Cranes  3.0       4       no

**15. Replace the priority column values with'yes' should be 1 and 'no' should be 0**

In [19]:
Birds_DataFrame.replace(('yes', 'no'), (1, 0), inplace=True)
Birds_DataFrame

# It works for other columns as well. We can write a fucntion for Priority column itself, as it not mandatory assignment
# I used the replace fucntion.

        birds  age  visits  priority
0      Cranes  3.5       2         1
1      Cranes  4.0       4         1
2     plovers  1.5       3         0
3  spoonbills  NaN       4         1
4  spoonbills  6.0       3         0
5      Cranes  3.0       4         0
6     plovers  5.5       2         0
7      Cranes  NaN       2         1
8  spoonbills  8.0       3         0
9  spoonbills  4.0       2         0

**16. In the 'birds' column, change the 'Cranes' entries to 'trumpeters'.**

In [20]:
Birds_DataFrame['birds'] = Birds_DataFrame['birds'].replace({'Cranes':'trumpeters'})
Birds_DataFrame

        birds  age  visits  priority
0  trumpeters  3.5       2         1
1  trumpeters  4.0       4         1
2     plovers  1.5       3         0
3  spoonbills  NaN       4         1
4  spoonbills  6.0       3         0
5  trumpeters  3.0       4         0
6     plovers  5.5       2         0
7  trumpeters  NaN       2         1
8  spoonbills  8.0       3         0
9  spoonbills  4.0       2         0